In [1]:
people = {
    "first": ["Georgi", 'Jane', 'John'], 
    "last": ["Alexandrov", 'Smith', 'Doe'], 
    "email": ["georgialexandrov@gmail.com", 'JaneSmith@email.com', 'JohnDoe@email.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         JaneSmith@email.com
2    John         Doe           JohnDoe@email.com

In [6]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [7]:
df.columns = ['first_name', 'last_name', 'email']

In [9]:
df

  first_name   last_name                       email
0     Georgi  Alexandrov  georgialexandrov@gmail.com
1       Jane       Smith         JaneSmith@email.com
2       John         Doe           JohnDoe@email.com

In [14]:
df.columns = [x.lower() for x in df.columns]
df

  first_name   last_name                       email
0     Georgi  Alexandrov  georgialexandrov@gmail.com
1       Jane       Smith         JaneSmith@email.com
2       John         Doe           JohnDoe@email.com

In [15]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [16]:
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         JaneSmith@email.com
2    John         Doe           JohnDoe@email.com

In [21]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         JaneSmith@email.com
2    John       Smith         JohnSmith@email.com

In [41]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [42]:
df.loc[2, 'last'] = 'Smith'
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         JaneSmith@email.com
2    John       Smith           JohnDoe@email.com

In [43]:
df.at[2, 'last'] = 'Doe'
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         JaneSmith@email.com
2    John         Doe           JohnDoe@email.com

In [47]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [54]:
df['email'] = df['email'].str.upper()

In [55]:
df['email'].apply(len)

0    26
1    19
2    17
Name: email, dtype: int64

In [56]:
def update_email(email):
    return email.upper()

In [57]:
df['email'].apply(update_email)

0    GEORGIALEXANDROV@GMAIL.COM
1           JANESMITH@EMAIL.COM
2             JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [58]:
df['email'] = df['email'].apply(update_email)

In [61]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         janesmith@email.com
2    John       Smith           johndoe@email.com

In [62]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [64]:
df.apply(lambda x: x.min())

first                        Georgi
last                     Alexandrov
email    georgialexandrov@gmail.com
dtype: object

In [65]:
df.applymap(len)

   first  last  email
0      6    10     26
1      4     5     19
2      4     5     17

In [66]:
df['first'].map({'Georgi': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [68]:
df['first'] = df['first'].replace({'Georgi': 'Chris', 'Jane': 'Mary'})